Ran Plan for dir: `tf_code` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_group.self_manage will be created
+ resource "aws_iam_group" "self_manage" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "self-manage"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_policy_attachment.self_manage_key will be created
+ resource "aws_iam_group_policy_attachment" "self_manage_key" {
      + group      = "self-manage"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_iam_group_policy_attachment.self_manage_mfa will be created
+ resource "aws_iam_group_policy_attachment" "self_manage_mfa" {
      + group      = "self-manage"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_iam_group_policy_attachment.self_manage_password will be created
+ resource "aws_iam_group_policy_attachment" "self_manage_password" {
      + group      = "self-manage"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_iam_policy.self_manage_key will be created
+ resource "aws_iam_policy" "self_manage_key" {
      + arn         = (known after apply)
      + description = "Allow users to manage their own access keys"
      + id          = (known after apply)
      + name        = "self-manage_self_manage_key"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:UpdateAccessKey",
                          + "iam:ListAccessKeys",
                          + "iam:GetUser",
                          + "iam:GetAccessKeyLastUsed",
                          + "iam:DeleteAccessKey",
                          + "iam:CreateAccessKey",
                        ]
                      + Condition = {
                          + Bool = {
                              + aws:MultiFactorAuthPresent = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:iam::396667666940:user/${aws:username}"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.self_manage_mfa will be created
+ resource "aws_iam_policy" "self_manage_mfa" {
      + arn         = (known after apply)
      + description = "Allow users to manage their own MFA"
      + id          = (known after apply)
      + name        = "self-manage_self_manage_mfa"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:ResyncMFADevice",
                          + "iam:EnableMFADevice",
                          + "iam:CreateVirtualMFADevice",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::396667666940:user/${aws:username}",
                          + "arn:aws:iam::396667666940:mfa/${aws:username}",
                        ]
                      + Sid      = "AllowUsersToCreateEnableResyncTheirOwnVirtualMFADevice"
                    },
                  + {
                      + Action    = "iam:DeactivateMFADevice"
                      + Condition = {
                          + Bool = {
                              + aws:MultiFactorAuthPresent = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:iam::396667666940:user/${aws:username}",
                          + "arn:aws:iam::396667666940:mfa/${aws:username}",
                        ]
                      + Sid       = "AllowUsersToDeactivateTheirOwnVirtualMFADevice"
                    },
                  + {
                      + Action    = "iam:DeleteVirtualMFADevice"
                      + Condition = {
                          + Bool = {
                              + aws:MultiFactorAuthPresent = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:iam::396667666940:user/${aws:username}",
                          + "arn:aws:iam::396667666940:mfa/${aws:username}",
                        ]
                      + Sid       = "AllowUsersToDeleteTheirOwnVirtualMFADevice"
                    },
                  + {
                      + Action   = [
                          + "iam:ListVirtualMFADevices",
                          + "iam:ListUsers",
                          + "iam:ListMFADevices",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowUsersToListMFADevicesandUsersForConsole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.self_manage_password will be created
+ resource "aws_iam_policy" "self_manage_password" {
      + arn         = (known after apply)
      + description = "Allow users to change their own passwords"
      + id          = (known after apply)
      + name        = "self-manage_self_manage_password"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "iam:GetLoginProfile"
                      + Condition = {
                          + Bool = {
                              + aws:MultiFactorAuthPresent = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:iam::396667666940:user/${aws:username}"
                      + Sid       = "VisualEditor0"
                    },
                  + {
                      + Action   = "iam:ChangePassword"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::396667666940:user/${aws:username}"
                      + Sid      = "VisualEditor1"
                    },
                  + {
                      + Action   = "iam:GetAccountPasswordPolicy"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "VisualEditor2"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_ssm_parameter.self_manage_group_name will be created
+ resource "aws_ssm_parameter" "self_manage_group_name" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/self-manage/self_manage_group_name"
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # null_resource.example will be created
+ resource "null_resource" "example" {
      + id = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d tf_code`
* :put_litter_in_its_place: To **delete** this plan click [here](https://f7d8c2196a5a.ngrok.io/lock?id=andreistefanciprian%252Fdemo-atlantis%252Ftf_code%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d tf_code`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
